УТ_для_edt.РасширениеСмарт/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Заметки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстСодержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляРабочегоСтола</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗаметки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредставлениеПредмета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9cca9751-c599-4906-ad10-d4c17fd84503">
    <name>смартКвалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Заметки/Forms/ЗаметкиПоПредмету/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// Богус + -----> адаптация Малыгина 30.01.2020
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.Автор.Видимость = Истина; // Богус +- Было Ложь
		Элементы.ПоказыватьЗаметкиДругихПользователей.Видимость = Истина;  // Богус +- Было Ложь
	КонецЕсли;
	// Богус -
	
	//++ #1919 смарт: Фролов 12.08.2024 //Добавить в список Заметок созданные по партнеру Интересы.
	//++ #1833 смарт: Фролов 27.05.2024 //Автоматическое создание заметок при квалификации интереса.
	//Список.ТекстЗапроса = "ВЫБРАТЬ
	//|	СправочникЗаметки.Ссылка КАК Ссылка,
	//|	СправочникЗаметки.ПометкаУдаления КАК ПометкаУдаления,
	//|	СправочникЗаметки.Предопределенный КАК Предопределенный,
	//|	СправочникЗаметки.Наименование КАК Наименование,
	//|	СправочникЗаметки.Автор КАК Автор,
	//|	СправочникЗаметки.Предмет КАК Предмет,
	//|	СправочникЗаметки.Содержание КАК Содержание,
	//|	СправочникЗаметки.ТекстСодержания КАК ТекстСодержания,
	//|	СправочникЗаметки.смартКвалификация КАК смартКвалификация,
	//|	СправочникЗаметки.ДляРабочегоСтола КАК ДляРабочегоСтола,
	//|	СправочникЗаметки.Пометка КАК Пометка,
	//|	ВЫБОР
	//|		КОГДА СправочникЗаметки.ПометкаУдаления
	//|			ТОГДА 0
	//|		КОГДА СправочникЗаметки.ЭтоГруппа
	//|			ТОГДА -1
	//|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.ПустаяСсылка)
	//|			ТОГДА 4
	//|		ИНАЧЕ ЕСТЬNULL(ЦветаЗаметок.Порядок, 0) + 2
	//|	КОНЕЦ КАК ИндексКартинки
	//|ИЗ
	//|	Справочник.Заметки КАК СправочникЗаметки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ЦветаЗаметок КАК ЦветаЗаметок
	//|		ПО СправочникЗаметки.Пометка.Порядок = ЦветаЗаметок.Порядок
	//|ГДЕ
	//|	((СправочникЗаметки.Предмет ССЫЛКА Документ.CRM_Интерес 
	//|	И 	СправочникЗаметки.Предмет.Партнер = &Предмет)
	//|	ИЛИ СправочникЗаметки.Предмет = &Предмет)
	//|	И (СправочникЗаметки.Автор = &Пользователь
	//|			ИЛИ &ПоказыватьЗаметкиДругихПользователей)
	//|	И (&ПоказыватьУдаленные
	//|			ИЛИ НЕ СправочникЗаметки.ПометкаУдаления)
	//|	И СправочникЗаметки.ЭтоГруппа = ЛОЖЬ";

	
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникЗаметки.Ссылка КАК Ссылка,
	|	""Заметка"" КАК смартСобытие,
	|	СправочникЗаметки.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникЗаметки.Предопределенный КАК Предопределенный,
	|	СправочникЗаметки.Наименование КАК Наименование,
	|	СправочникЗаметки.Автор КАК Автор,
	|	СправочникЗаметки.Предмет КАК Предмет,
	|	СправочникЗаметки.Содержание КАК Содержание,
	|	СправочникЗаметки.ТекстСодержания КАК ТекстСодержания,
	|	СправочникЗаметки.смартКвалификация КАК смартКвалификация,
	|	СправочникЗаметки.ДляРабочегоСтола КАК ДляРабочегоСтола,
	|	СправочникЗаметки.Пометка КАК Пометка,
	|	ВЫБОР
	|		КОГДА СправочникЗаметки.ПометкаУдаления
	|			ТОГДА 0
	|		КОГДА СправочникЗаметки.ЭтоГруппа
	|			ТОГДА -1
	|		КОГДА СправочникЗаметки.Пометка = ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.ПустаяСсылка)
	|			ТОГДА 4
	|		ИНАЧЕ ЕСТЬNULL(ЦветаЗаметок.Порядок, 0) + 2
	|	КОНЕЦ КАК ИндексКартинки,
	|	СправочникЗаметки.ДатаЗаметки КАК смартДатаСобытия
	|ИЗ
	|	Справочник.Заметки КАК СправочникЗаметки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ЦветаЗаметок КАК ЦветаЗаметок
	|		ПО СправочникЗаметки.Пометка.Порядок = ЦветаЗаметок.Порядок
	|ГДЕ
	|	(СправочникЗаметки.Предмет ССЫЛКА Документ.CRM_Интерес
	|				И СправочникЗаметки.Предмет.Партнер = &Предмет
	|			ИЛИ СправочникЗаметки.Предмет = &Предмет)
	|	И (СправочникЗаметки.Автор = &Пользователь
	|			ИЛИ &ПоказыватьЗаметкиДругихПользователей)
	|	И (&ПоказыватьУдаленные
	|			ИЛИ НЕ СправочникЗаметки.ПометкаУдаления)
	|	И СправочникЗаметки.ЭтоГруппа = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CRM_Интерес.Ссылка,
	|	""Интерес"",
	|	CRM_Интерес.ПометкаУдаления,
	|	ЛОЖЬ,
	|	CRM_Интерес.Тема,
	|	CRM_Интерес.Ответственный,
	|	CRM_Интерес.Партнер,
	|	ВЫРАЗИТЬ(CRM_Интерес.Описание КАК СТРОКА(500)),
	|	ВЫРАЗИТЬ(CRM_Интерес.Описание КАК СТРОКА(500)),
	|	CRM_Интерес.смартИтоговаяКвалификация,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.ПустаяСсылка),
	|	2,
	|	CRM_Интерес.Дата
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	CRM_Интерес.Партнер = &Предмет
	|	И (CRM_Интерес.Ответственный = &Пользователь
	|			ИЛИ &ПоказыватьЗаметкиДругихПользователей)
	|	И (&ПоказыватьУдаленные
	|			ИЛИ НЕ CRM_Интерес.ПометкаУдаления)
	|
	//++ #Б-1256 смарт: Фролов 01.11.2024 //Добавление взаимодействий в список заметок.
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CRM_Взаимодействие.Ссылка,
	|	""Взаимодействие"",
	|	CRM_Взаимодействие.ПометкаУдаления,
	|	ЛОЖЬ,
	|	ВЫРАЗИТЬ(CRM_Взаимодействие.Результат КАК СТРОКА(500)),
	|	CRM_Взаимодействие.Ответственный,
	|	CRM_Взаимодействие.Партнер,
	|	CRM_Взаимодействие.Тема,
	|	ВЫРАЗИТЬ(CRM_Взаимодействие.Содержание КАК СТРОКА(500)),
	|	"""",
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Перечисление.ЦветаЗаметок.ПустаяСсылка),
	|	2,
	|	CRM_Взаимодействие.ДатаЗавершенияВзаимодействия
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	CRM_Взаимодействие.Партнер = &Предмет
	|	И (CRM_Взаимодействие.Ответственный = &Пользователь
	|			ИЛИ &ПоказыватьЗаметкиДругихПользователей)
	|	И (&ПоказыватьУдаленные
	|			ИЛИ НЕ CRM_Взаимодействие.ПометкаУдаления)
	|	И CRM_Взаимодействие.СтатусВзаимодействия = Значение(Справочник.CRM_СостоянияСобытий.Завершено)";
	//-- #Б-1256 смарт: Фролов 01.11.2024
	
	Список.ОсновнаяТаблица = Неопределено;
	
	КолонкаСписка = Элементы.Вставить("смартДатаСобытия", Тип("ПолеФормы"), Элементы.Список, Элементы.Список.ПодчиненныеЭлементы.Наименование);
	КолонкаСписка.ПутьКДанным = "Список.смартДатаСобытия";
	КолонкаСписка.Заголовок = "Дата события";
	
	КолонкаСписка = Элементы.Вставить("смартСобытие", Тип("ПолеФормы"), Элементы.Список, Элементы.Список.ПодчиненныеЭлементы.смартДатаСобытия);
	КолонкаСписка.ПутьКДанным = "Список.смартСобытие";
	КолонкаСписка.Заголовок = "Событие";
	
	НоваяКоманда = Команды.Добавить("смартСоздатьЗаметку");
	НоваяКоманда.Действие = "смартСоздатьЗаметку";
	
	НовыйЭлемент = Элементы.Добавить("смартСоздатьЗаметку", Тип("КнопкаФормы"), Элементы.КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Создать заметку";
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	НовыйЭлемент.ИмяКоманды = "смартСоздатьЗаметку";

	//-- #1919 смарт: Фролов 12.08.2024
	
	КолонкаСписка = Элементы.Вставить("смартКвалификация", Тип("ПолеФормы"), Элементы.Список, Элементы.Список.ПодчиненныеЭлементы.Наименование);
	КолонкаСписка.ПутьКДанным = "Список.смартКвалификация";
	КолонкаСписка.Вид = ВидПоляФормы.ПолеФлажка;
	КолонкаСписка.Заголовок = "Квалификация";
	//-- #1833 смарт: Фролов 27.05.2024
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 07.09.2021 11:52:31
&НаКлиенте
Процедура смарт_СписокВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	//++ #1919 смарт: Фролов 12.08.2024 //Добавить в список Заметок созданные по партнеру Интересы.
	//ОткрытьФорму("Справочник.Заметки.ФормаОбъекта",Новый Структура("Ключ, ЗаметкаЛенты",Элементы.Список.ТекущиеДанные.Ссылка,Истина),ЭтаФорма);
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.Заметки") Тогда
		
		ОткрытьФорму("Справочник.Заметки.ФормаОбъекта", Новый Структура("Ключ, ЗаметкаЛенты", ТекущиеДанные.Ссылка, Истина), ЭтаФорма);
		
	//++ #Б-1256 смарт: Фролов 01.11.2024 //Добавление взаимодействий в список заметок.
	ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
		
		ОткрытьФорму("Документ.CRM_Взаимодействие.Форма.ФормаДокумента", Новый Структура("Ключ", ТекущиеДанные.Ссылка), ЭтаФорма);
	//-- #Б-1256 смарт: Фролов 01.11.2024	
	Иначе
		
		ОткрытьФорму("Документ.CRM_Интерес.Форма.ФормаДокументаНовая", Новый Структура("Ключ", ТекущиеДанные.Ссылка), ЭтаФорма);
		
	КонецЕсли;	
	//-- #1919 смарт: Фролов 12.08.2024
	
КонецПроцедуры

//&НаСервере
//Процедура смарт_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
//		
//	УстановитьУсловноеОформление();
//	
//	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
//		Возврат;
//	КонецЕсли;
//	
//	Если Параметры.Свойство("Предмет") Тогда 
//		Предмет = Параметры.Предмет;
//		Список.Параметры.УстановитьЗначениеПараметра("Предмет", Предмет);
//	КонецЕсли;
//	
//	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
//	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьЗаметкиДругихПользователей", Ложь);
//	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьУдаленные", Ложь);
//	
//	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
//		Элементы.Автор.Видимость = Истина; // Богус +- Было Ложь
//		Элементы.ПоказыватьЗаметкиДругихПользователей.Видимость = Истина;  // Богус +- Было Ложь
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

&НаКлиенте
Процедура смартСоздатьЗаметку(Команда)
	
	ОткрытьФорму("Справочник.Заметки.Форма.CRM_ФормаЭлемента", Новый Структура("Предмет", ЭтаФорма.ВладелецФормы.Объект.Ссылка));

КонецПроцедуры

#КонецОбласти
